## Staging: rds
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 9 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                             NAME                             |
|----------|--------------------------------------------------------------|
| update   | `aws_rds_cluster.notification-canada-ca`                     |
| recreate | `aws_rds_cluster_parameter_group.default`                    |
| add      | `module.rds_proxy.aws_cloudwatch_log_group.this[0]`          |
|          | `module.rds_proxy.aws_db_proxy.this[0]`                      |
|          | `module.rds_proxy.aws_db_proxy_default_target_group.this[0]` |
|          | `module.rds_proxy.aws_db_proxy_endpoint.this[&quot;read_only&quot;]`   |
|          | `module.rds_proxy.aws_db_proxy_endpoint.this[&quot;read_write&quot;]`  |
|          | `module.rds_proxy.aws_db_proxy_target.db_cluster[0]`         |
|          | `module.rds_proxy.aws_iam_role.this[0]`                      |
|          | `module.rds_proxy.aws_iam_role_policy.this[0]`               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_rds_cluster.notification-canada-ca will be updated in-place
  ~ resource "aws_rds_cluster" "notification-canada-ca" {
      ~ db_cluster_parameter_group_name     = "default.aurora-postgresql15" -> "rds-cluster-pg"
        id                                  = "notification-canada-ca-staging-cluster"
        tags                                = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (38 unchanged attributes hidden)
    }

  # aws_rds_cluster_parameter_group.default must be replaced
-/+ resource "aws_rds_cluster_parameter_group" "default" {
      ~ arn         = "arn:aws:rds:ca-central-1:239043911459:cluster-pg:rds-cluster-pg" -> (known after apply)
      ~ family      = "aurora-postgresql11" -> "aurora-postgresql15" # forces replacement
      ~ id          = "rds-cluster-pg" -> (known after apply)
        name        = "rds-cluster-pg"
      + name_prefix = (known after apply)
        tags        = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (2 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.rds_proxy.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/rds/proxy/rds-proxy"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all          = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
    }

  # module.rds_proxy.aws_db_proxy.this[0] will be created
  + resource "aws_db_proxy" "this" {
      + arn                    = (known after apply)
      + debug_logging          = false
      + endpoint               = (known after apply)
      + engine_family          = "POSTGRESQL"
      + id                     = (known after apply)
      + idle_client_timeout    = 1800
      + name                   = "rds-proxy"
      + require_tls            = true
      + role_arn               = (known after apply)
      + tags                   = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all               = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + vpc_security_group_ids = [
          + "sg-0e2c3ef6c5c75b74c",
        ]
      + vpc_subnet_ids         = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]

      + auth {
          + auth_scheme               = "SECRETS"
          + client_password_auth_type = (known after apply)
          + description               = "Database superuser app_db_user, database connection values"
          + iam_auth                  = "DISABLED"
          + secret_arn                = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:app_db_user-NwdRDQ"
        }
      + auth {
          + auth_scheme               = "SECRETS"
          + client_password_auth_type = (known after apply)
          + description               = "Database superuser postgres, database connection values"
          + iam_auth                  = "DISABLED"
          + secret_arn                = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:postgres-eDOk4f"
        }
    }

  # module.rds_proxy.aws_db_proxy_default_target_group.this[0] will be created
  + resource "aws_db_proxy_default_target_group" "this" {
      + arn           = (known after apply)
      + db_proxy_name = "rds-proxy"
      + id            = (known after apply)
      + name          = (known after apply)

      + connection_pool_config {
          + connection_borrow_timeout    = 120
          + max_connections_percent      = 90
          + max_idle_connections_percent = 50
        }
    }

  # module.rds_proxy.aws_db_proxy_endpoint.this["read_only"] will be created
  + resource "aws_db_proxy_endpoint" "this" {
      + arn                    = (known after apply)
      + db_proxy_endpoint_name = "read-only-endpoint"
      + db_proxy_name          = "rds-proxy"
      + endpoint               = (known after apply)
      + id                     = (known after apply)
      + is_default             = (known after apply)
      + tags                   = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all               = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + target_role            = "READ_ONLY"
      + vpc_id                 = (known after apply)
      + vpc_security_group_ids = [
          + "sg-0e2c3ef6c5c75b74c",
        ]
      + vpc_subnet_ids         = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
    }

  # module.rds_proxy.aws_db_proxy_endpoint.this["read_write"] will be created
  + resource "aws_db_proxy_endpoint" "this" {
      + arn                    = (known after apply)
      + db_proxy_endpoint_name = "read-write-endpoint"
      + db_proxy_name          = "rds-proxy"
      + endpoint               = (known after apply)
      + id                     = (known after apply)
      + is_default             = (known after apply)
      + tags                   = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all               = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + target_role            = "READ_WRITE"
      + vpc_id                 = (known after apply)
      + vpc_security_group_ids = [
          + "sg-0e2c3ef6c5c75b74c",
        ]
      + vpc_subnet_ids         = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
    }

  # module.rds_proxy.aws_db_proxy_target.db_cluster[0] will be created
  + resource "aws_db_proxy_target" "db_cluster" {
      + db_cluster_identifier = "notification-canada-ca-staging-cluster"
      + db_proxy_name         = "rds-proxy"
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + port                  = (known after apply)
      + rds_resource_id       = (known after apply)
      + target_arn            = (known after apply)
      + target_group_name     = (known after apply)
      + tracked_cluster_id    = (known after apply)
      + type                  = (known after apply)
    }

  # module.rds_proxy.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "rds.amazonaws.com"
                        }
                      + Sid       = "RDSAssume"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "rds-proxy-to-secrets-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all              = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + unique_id             = (known after apply)
    }

  # module.rds_proxy.aws_iam_role_policy.this[0] will be created
  + resource "aws_iam_role_policy" "this" {
      + id     = (known after apply)
      + name   = "rds-proxy-to-secrets-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:Decrypt"
                      + Condition = {
                          + StringEquals = {
                              + "kms:ViaService" = "secretsmanager.ca-central-1.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:kms:ca-central-1:239043911459:key/a92df413-fc30-4f3e-8047-7433e1a8ad02"
                      + Sid       = "DecryptSecrets"
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:ListSecrets",
                          + "secretsmanager:GetRandomPassword",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ListSecrets"
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:ListSecretVersionIds",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:ca-central-1:239043911459:secret:postgres-eDOk4f",
                          + "arn:aws:secretsmanager:ca-central-1:239043911459:secret:app_db_user-NwdRDQ",
                        ]
                      + Sid      = "GetSecrets"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

Plan: 9 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  + database_read_only_proxy_endpoint  = (known after apply)
  + database_read_write_proxy_endpoint = (known after apply)
  - rds_endpoint                       = "notification-canada-ca-staging-cluster.cluster-cjxcfmgad2pq.ca-central-1.rds.amazonaws.com" -> null

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_db_event_subscription.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_event_subscription.notification-canada-ca-cluster"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.default"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.app_db_user"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_user"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_cloudwatch_log_group.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy_endpoint.this[\"read_only\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy_endpoint.this[\"read_write\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_iam_role.this[0]"]

34 tests, 19 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
